#!/bin/bash
 
pandoc *.docx -o 0_semi_done.md
 
	# Эта строка позволяет добрасывать ноль к простым значениям дня
sed -r -e 'sx([^0-9]|^)([0-9]...)x\10\2xg' -e 'sx/([0-9]/)x/0\1xg' 0_semi_done.md >> 0_semi_done_1.md 

sed '

	/[**]/s/\ января\ /.01./g
	/[**]/s/\ февраля\ /.02./g
	/[**]/s/\ марта\ /.03./g
	/[**]/s/\ апреля\ /.04./g
	/[**]/s/\ мая\ /.05./g
	/[**]/s/\ июня\ /.06./g
	/[**]/s/\ июля\ /.07./g
	/[**]/s/\ августа\ /.08./g
	/[**]/s/\ сентября\ /.09./g
	/[**]/s/\ октября\ /.10./g
	/[**]/s/\ ноября\ /.11./g
	/[**]/s/\ декабря\ /.12./g

	s/**//g
	s/«/"/g
	s/»/"/g
	s/--/-/g
	s/--/-/g
	s/[\"]/"/g
	s/""/"/g
	s/"</</g
	s/">/>/g

' 0_semi_done_1.md >> 00.txt

rm 0_semi_done.md
rm 0_semi_done_1.md

echo 
echo -e '\033[0;32mdone!'
echo 
